# GetRevitUIFamilyLoadOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..GetRevitUIFamilyLoadOptions Method
UIDocument Class See Also
---
Return the option object that allows you to use Revit's dialog boxes to let the user respond to questions that arise during loading of families.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IFamilyLoadOptions GetRevitUIFamilyLoadOptions()
```

Visual Basic
---
```text
Public Shared Function GetRevitUIFamilyLoadOptions As IFamilyLoadOptions
```

Visual C++
---
```text
public:
static IFamilyLoadOptions^ GetRevitUIFamilyLoadOptions()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if this API method is invoked in UI less mode |

# See Also
UIDocument Class
Autodesk.Revit.UI Namespace